Tekla.Structures.ModelInternal.PickerInternal.PickObjectType
The possible model object pick types.

Tekla.Structures.ModelInternal.PickerInternal.PickObjectType.AnyObject


Tekla.Structures.ModelInternal.PickerInternal.PickObjectType.Part


Tekla.Structures.ModelInternal.PickerInternal.PickObjectType.Weld


Tekla.Structures.ModelInternal.PickerInternal.PickObjectType.BoltGroup


Tekla.Structures.ModelInternal.PickerInternal.PickObjectType.Reinforcement


Tekla.Structures.ModelInternal.PickerInternal.PickObjectType.AnyAnalysisObject


Tekla.Structures.ModelInternal.PickerInternal.PickObjectType.AnalysisPart


Tekla.Structures.ModelInternal.PickerInternal.PickObjectType.AnalysisNode


Tekla.Structures.ModelInternal.PickerInternal.PickObjectType.AnalysisNodeLink
